app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE (title LIKE('%%')) LIMIT 20
---
  def search
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)